// 6.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <cmath>
using namespace std;
int main()
{
    setlocale(NULL, "rus");
    double a, b, c,D,x;
    cout << "Введите a,b,c" << "\n";
    cin >> a >> b >> c;
    D =pow(b, 2) - (4 * a * c);
    if (D >= 0)
    {
        x = (-b + sqrt(D)) / (2 * a);
        cout << "x1=" << x << "\n";
        x = (-b - sqrt(D)) / (2 * a);
        cout << "x2=" <<  x << "\n";
    }
    else cout << "Корней нет \n";
    system("pause");
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
